* hello(name) with a default argument
Give the `name` argument a default value.

#+begin_src R
hello <- function(name="Jack") {
  print(paste("hello", name))
}
hello()

#+end_src

#+results:
: hello Jack

